pets = {}
pets2 = {}
while (True):
    a1 = input('Введите имя питомца  (клавиша enter - выход): ')
    if a1 == '':
        break
    else:
        a = input('Вид питомца: ')
        a2 = int(input('Возраст питомца: '))
        y = ''
        if a2 % 10 == 1 and a2 != 11 and a2 % 100 != 11:
            y = 'год'
        elif 1 < a2 % 10 <= 4 and a2 != 12 and a2 != 13 and a2 != 14:
            y = 'года'
        else:
            y = 'лет'
    a3 = input('Имя владельца:  ')
    pets2 = {'Вид питомца:':a, 'Возраст питомца:':a2, 'Имя владельца:':a3  }
    pets[a1] = pets2
    print(f'Это, {pets2['Вид питомца:']}, по кличке {a1}. Возраст питомца: {pets2['Возраст питомца:']} {y}. Имя владельца: {pets2['Имя владельца:']}.')